{
  "lang": {
    "title": "Français"
  },
  "header": {
    "download": "CV",
    "home": "Acceuil",
    "resume": "CV.pdf",
    "titlesearch": "Recherche par titre"
  },
  "footer": {
    "poweredby": "Réalisé par"
  },
  "home": {
    "name": "Brahim Abdelli",
    "hello": "Salut! C'est moi",
    "description": "Je construis des choses.",
    "location": "Nantes, France",
    "bio": "Ingénieur logiciel, je développe des backends robustes avec NestJS & Spring Boot et des frontends soignés avec React & Angular. Tous mes projets sont sur GitHub, prêts à être forkés et explorés.",
    "links": {
      "email": "Email",
      "github": "Github",
      "linkedin": "Linkedin"
    },
    "company": {
      "softeam": "Softeam",
      "excellia": "Excellia Solutions",
      "name": "Softeam"
    },
    "schools": {
      "esprit": "ESPRIT",
      "isetrades": "ISET Tunis"
    },
    "aboutme": {
      "name": "A propos de moi",
      "bio1": "Je suis un ingénieur logiciel passionné par la construction des solutions webs, le développement est une activité que j'exerce quotidiennement avec passion.",
      "bio2": "En dehors du code et des sujets liés au logiciel, j'aime voyager, jouer aux jeux vidéo, lire, regarder des séries et faire du sport en compétition.",
      "bio3": "Je m'efforce d'apporter une bonne énergie, les connaissances techniques et une forte envie d'apprendre avec moi partout où je vais.",
      "description1": "J'ai plus de 4 ans d'expérience dans la conception, le développement, les tests et le déploiement d'applications web.",
      "description2": "Je travaille avec Javascript, Typescript et Java.",
      "backend": "Backend : NestJS, Spring Boot.",
      "frontend": "Frontend : React, Angular.",
      "description3": "J'aime aussi des sujets comme le clean code, l'optimisation, les performances applicatives et le SEO."
    },
    "projects": {
      "name": "PROJETS",
      "bio": "Je suis toujours entrain de développer une nouvelle chose.",
      "description": "Vous pouvez trouver toutes mes respositories publiques sur mon profil GitHub.",
      "portfolio": {
        "description": "Ce portfolio a été créé pour présenter mon travail d'ingénieur logiciel. J'essaie de le tenir à jour."
      },
      "nestier": {
        "description": "Boilerplate NestJS prêt pour la production, soutenu par le projet officiel awesome-nestjs. Architecture hexagonale, Domain-Driven Design et Generic Repository Pattern."
      },
      "autosansrisque": {
        "description1": "Auparavant promu sous le nom de Karhabtek.",
        "description2": "Plateforme de mise en relation dans le secteur automobile. J'ai développé le MVP avec intégration paiement en ligne.",
        "description3": "Ce projet est soutenu par l'incubateur BiatLabs.",
        "description4": "Toujours en développement avec d'autres développeurs."
      },
      "clothingcompany": {
        "name": "Compagnie de Vêtements",
        "description": "Développement d’un site web pour la commande en ligne et la gestion de stock."
      },
      "adventofcode": {
        "description": "Ce repository contient ma tentative de résolution de Advent of Code groupée par année."
      },
      "tekmanda": {
        "description": "J'ai contribué à ce projet en ajoutant des nouvelles fonctionnalités pour cette plateforme, ma contribution était surtout sur la partie Frontend."
      }
    },
    "workexperience": {
      "name": "EXPERIENCES PROFESSIONNELLES",
      "bio": "Ingénieur logiciel chez Softeam.",
      "softeam": {
        "descriptionShort": "Ingénieur logiciel chez Softeam depuis février 2024. J'ai travaillé sur deux projets à grande échelle avec des architectures complexes.",
        "description": "Je travaille chez Softeam depuis février 2024. Je développe une plateforme de gestion des épreuves en ligne (code de la route, moto) avec une architecture hexagonale, DDD, NestJS, Angular, Kafka et Kubernetes.",
        "tech": "Tech : NestJS, Angular, MySQL, Kafka, TypeORM, Elasticsearch, Kibana, Grafana, Kubernetes, Amazon S3, Jest, Sonar, Jenkins, Openshift."
      },
      "excellia": {
        "description": "J'ai travaillé chez Excellia Solutions, développant des sites web pour des solutions bancaires et des services financiers.",
        "tech": "Tech : Spring Boot, NestJS, React, Angular, PostgreSQL, MongoDB, ActiveMQ, TypeORM, Docker, Kubernetes."
      }
    },
    "internships": {
      "name": "STAGES",
      "bio": "En tant qu'étudiant en génie logiciel, j'ai effectué plusieurs stages.",
      "description": "Ce sont les stages que j'ai effectués en étant un étudiant.",
      "placeholder": {
        "description": "Développement d'une plateforme de mise en relation dans le secteur automobile."
      },
      "espritdsi": {
        "description1": "Scrapping interne du site et mise à jour automatique du dictionnaire d'indexation.",
        "description2": "Développement de modules internes : gestion des membres, projets et équipes."
      },
      "steg": {
        "name": "Société Tunisienne de l'Electricité et du Gaz",
        "description": "Développement d’un site web pour la gestion de la bibliothèque."
      }
    },
    "certifications": {
      "name": "CERTIFICATIONS",
      "description": "Je les utilise pour diversifier mes compétences et mes connaissances.",
      "ckad": {
        "name": "CKAD : Certified Kubernetes Application Developer",
        "description": "Une certification qui atteste que le candidat peut concevoir, construire et déployer des applications cloud-native sur Kubernetes.",
        "tags": "Kubernetes, Devops, Docker"
      }
    },
    "school": {
      "name": "UNIVERSITES",
      "bio": "En tant qu'étudiant en génie logiciel, j'ai effectué plusieurs stages.",
      "description1": "Diplômé avec la plus haute distinction d'ESPRIT en 2021 après avoir poursuivi un diplôme en génie logiciel.",
      "description2": "J'ai obtenu mon diplôme d'ingénieur en génie logiciel d'ESPRIT en 2021.",
      "espritinfo": {
        "description": "J'ai fait 3 ans d'études en ingénierie informatique en génie logiciel."
      },
      "espritelectro": {
        "description": "J'ai fait 2 ans d'études en électromécanique avant de changer de parcours."
      },
      "isetrades": {
        "description": "Licence appliquée en génie mécanique spécialité énergétique."
      }
    },
    "activities": {
      "name": "ACTIVITEES",
      "bio": "Plusieurs choses attirent mon attention.",
      "description": "La vie ne s'arrête pas lorsque vous arrêtez de coder.",
      "music": {
        "name": "Musique",
        "description1": "Faire et écouter de la musique est une partie essentielle de ma vie.",
        "description2": "Ne soyez pas surpris sit cliquer sur cette partie vous redirigerais vers Spotify!"
      },
      "reading": {
        "name": "LECTURE",
        "description": "J'aime lire un peu de tout de l'histoire aux romans.",
        "books": "Livres"
      },
      "sports": {
        "description": "Tout ce qui fait pomper le sang et implique des défis.",
        "jogging": "Jogging",
        "swimming": "Natation"
      },
      "travel": {
        "name": "Voyage",
        "description": "J'aime explorer de nouveaux endroits et cultures."
      }
    },
    "resources": {
      "name": "RESSOURCES POUR RESTER À JOUR",
      "description": "Créateurs de contenu tech, formations et chaînes que je suis.",
      "items": {
        "hussein": "Hussein Nasser",
        "husseinDescription": "Approfondissements sur le réseau, les BDD, le system design et le backend. Explications claires et cas concrets. Formations structurées sur Udemy aussi.",
        "webdevcody": "Web Dev Cody",
        "webdevcodyDescription": "Tutoriels web et projets pas à pas. Contenu React, Next.js et full-stack.",
        "primeagen": "The Primeagen",
        "primeagenDescription": "Vim, TypeScript, system design et pratiques d'ingénierie. Direct et très technique.",
        "devto": "dev.to",
        "devtoDescription": "Communauté et blog développeurs. Articles, discussions et tutoriels du monde entier.",
        "fireship": "Fireship",
        "fireshipDescription": "Explications tech courtes et rythmées. Frameworks, outils et concepts en quelques minutes."
      }
    },
    "contanctme": "Contactez-Moi",
    "copyright": "Droits d'auteur",
    "takecare": "Prenez soin de vous et rappelez-vous, votre santé est votre priorité."
  },
  "articles": {
    "searchs": {
      "searchbytitle": "Recherche par titre",
      "entersearch": "Tapez votre recherche",
      "noresultsfound": "Aucun résultat trouvé"
    }
  }
}
