{
  "lang": {
    "title": "English"
  },
  "header": { "download": "Download Resume", "home": "Home" },
  "home": {
    "hello": "Hello! It's me",
    "description": "I build things.",
    "aboutme": {
      "name": "ABOUT ME",
      "bio1": "I'm a Full Stack developer with a passion for building web solutions. Coding is an activity I exercise every day with passion.",
      "bio2": "Outside coding, I listen and make music, go out and explore new places with my friends. I love video games, reading, watching old movies, and sports.",
      "bio3": "I strive to bring good energy, technical knowledge, and a strong desire to learn with me wherever I go.",
      "description1": "I have accumulated experience in designing, developing, testing, and deploying web apps from scratch for 2 years.",
      "description2": "I hold a particular interest in Javascript, Typescript, and Java.",
      "description3": "Also in optimization, enhancing app performance and SEO."
    },
    "projects": {
      "name": "PROJECTS",
      "bio": "I'm always cooking something new.",
      "description": "Catch all my public repositories on my GitHub profile.",
      "portfolio": {
        "description": "This is a personal Portfolio I created to showcase my work as a software engineer. I will try to always update this project."
      },
      "autosansrisque": {
        "description1": "Previously promoted as Karhabtek.",
        "description2": "It's a website that connects car experts and clients. I developed the MVP for the project even integrating an online payment service.",
        "description3": "This project is backed by BiatLabs incubator.",
        "description4": "and still in the development phase with other developers."
      },
      "clothingcompany": {
        "name": "CLOTHING COMPANY",
        "description": "Developed a website for a clothing company allowing administrators to manage the stock."
      },
      "adventofcode": {
        "description": "This repository contains my attempt at solving Advent of Code by annual set."
      },
      "tekmanda": {
        "description": "I contributed by adding and implementing some features for this food services platform, my contribution was mainly in the Frontend part."
      }
    },
    "workexperience": {
      "name": "WORK EXPERIENCE",
      "bio": "Currently a Full Stack Developer at MSS.",
      "description": "I'm currently working at MSS, developing websites for banking solutions and financial services. this is my first work experience excluding personal projects and contributions. You can check us out in Linkedin."
    },
    "internships": {
      "name": "INTERNSHIPS",
      "bio": "As a software engineering student I did multiple internships.",
      "description": "These are the internships that I did in the past.",
      "placeholder": {
        "description1": "Development of a website that connects car experts and clients",
        "description2": "This project is still in the development phase with other developers."
      },
      "espritdsi": {
        "description1": "Internal site scrapping and automatic update of the indexing dictionary.",
        "description2": "Development of member management, a project management and an RDI (Research, Development and Innovation)."
      },
      "steg": {
        "name": "Tunisian Company of Electricity and Gas",
        "description": "Development of an internal website for library management."
      }
    },
    "school": {
      "name": "SCHOOL",
      "bio": "As a software engineering student I did multiple internships.",
      "description1": "Graduated with the highest honors from ESPRIT in 2021 after pursuing a degree in software engineering.",
      "description2": "Had my software engineering degree from ESPRIT in 2021.",
      "espritinfo": {
        "description": "Studied software engineering for 3 years."
      },
      "espritelectro": {
        "description": "Pursued studies in electromechanical engineering for 2 years before changing the course."
      },
      "isetrades": {
        "description": "Bachelor's degree in mechanical engineering specializing in energy."
      }
    },
    "activities": {
      "name": "ACTIVITIES",
      "bio": "Multiple things catch my attention.",
      "description": "Life doesn't stop when you stop coding.",
      "music": {
        "name": "Music",
        "description1": "Making and listening to music is a huge part of my life.",
        "description2": "Don't be surprised if clicking on this section one day will redirect you to Spotify."
      },
      "reading": {
        "name": "reading",
        "description": "I Love reading anything from history to novels.",
        "books": "Books"
      },
      "sports": {
        "description": "Anything that gets the blood pumping and involves challenges.",
        "jogging": "Jogging",
        "swimming": "Swimming"
      }
    },
    "contanctme": "Contact Me",
    "copyright": "Copyright ",
    "takecare": "Take care and remember, health comes first."
  }
}
