{
  "lang": {
    "title": "English"
  },
  "header": {
    "download": "Resume",
    "home": "Home",
    "resume": "Resume.pdf",
    "titlesearch": "Title Search"
  },
  "footer": {
    "poweredby": "Powered by"
  },
  "home": {
    "name": "Brahim Abdelli",
    "hello": "Hello! It's me",
    "description": "I build things.",
    "location": "Nantes, France",
    "bio": "Software engineer building robust backends with NestJS & Spring Boot, and polished frontends with React & Angular. Every project lands on GitHub for you to fork & explore.",
    "links": {
      "email": "Email",
      "github": "Github",
      "linkedin": "Linkedin"
    },
    "company": {
      "softeam": "Softeam",
      "excellia": "Excellia Solutions"
    },
    "schools": {
      "esprit": "ESPRIT",
      "isetrades": "ISET Tunis"
    },
    "aboutme": {
      "name": "ABOUT ME",
      "bio1": "I'm a Software Engineer with a passion for building web solutions. Coding is an activity I exercise every day with passion.",
      "bio2": "Outside coding and software related topics, I love traveling, playing video games, reading and watching tv shows and competing in sports.",
      "bio3": "I strive to bring good energy, technical knowledge, and a strong desire to learn with me wherever I go.",
      "description1": "I have 4+ years of experience designing, developing, testing, and deploying web applications.",
      "description2": "I focus on Javascript, Typescript, and Java.",
      "backend": "Backend: NestJS, Spring Boot.",
      "frontend": "Frontend: React, Angular.",
      "description3": "I also love topics like clean code, optimization, app performance, and SEO."
    },
    "projects": {
      "name": "PROJECTS",
      "bio": "I'm always cooking something new.",
      "description": "Catch all my public repositories on my GitHub profile.",
      "portfolio": {
        "description": "This is a personal portfolio I created to showcase my work as a software engineer. I try to keep it updated."
      },
      "nestier": {
        "description": "Production-ready NestJS boilerplate supported by the official awesome-nestjs project. Hexagonal architecture, Domain-Driven Design, and Generic Repository Pattern."
      },
      "autosansrisque": {
        "description1": "Previously promoted as Karhabtek.",
        "description2": "A service marketplace platform for the automotive sector. I developed the MVP including online payment integration.",
        "description3": "This project is backed by BiatLabs incubator.",
        "description4": "Still in development with other developers."
      },
      "clothingcompany": {
        "name": "Clothing Company",
        "description": "Developed a website for a clothing company allowing administrators to manage the stock."
      },
      "adventofcode": {
        "description": "This repository contains my attempt at solving Advent of Code by annual set."
      },
      "tekmanda": {
        "description": "I contributed by adding and implementing some features for this food services platform, my contribution was mainly in the Frontend part."
      }
    },
    "workexperience": {
      "name": "WORK EXPERIENCE",
      "bio": "Software Engineer at Softeam.",
      "softeam": {
        "descriptionShort": "Software Engineer at Softeam since February 2024. I worked on two large scale projects involving complex architectures.",
        "description": "I work at Softeam since February 2024. I develop an online examination management platform (driving theory, motorcycle exams) using hexagonal architecture, DDD, NestJS, Angular, Kafka, and Kubernetes.",
        "tech": "Tech: NestJS, Angular, MySQL, Kafka, TypeORM, Elasticsearch, Kibana, Grafana, Kubernetes, Amazon S3, Jest, Sonar, Jenkins, Openshift."
      },
      "excellia": {
        "description": "At Excellia Solutions I built banking and e-KYC platforms: international banking operations.",        "tech": "Tech: Spring Boot, NestJS, React, Angular, PostgreSQL, MongoDB, ActiveMQ, TypeORM, Docker, Kubernetes."
      }
    },
    "internships": {
      "name": "INTERNSHIPS",
      "bio": "As a software engineering student I did multiple internships.",
      "description": "These are the internships that I did in the past.",
      "placeholder": {
        "description": "Development of a service marketplace platform for the automotive sector."
      },
      "espritdsi": {
        "description1": "Web scraping and improvement of the indexing dictionary.",
        "description2": "Development of internal modules: member, project, and team management."
      },
      "steg": {
        "name": "Tunisian Company of Electricity and Gas",
        "description": "Development of an internal website for library management."
      }
    },
    "certifications": {
      "name": "CERTIFICATIONS",
      "description": "I use them as a way to diversify my skills and knowledge.",
      "ckad": {
        "name": "CKAD : Certified Kubernetes Application Developer",
        "description": "A certification that certifies that candidates can design, build and deploy cloud-native applications for Kubernetes.",
        "tags": "Kubernetes, Devops, Docker"
      }
    },
    "school": {
      "name": "SCHOOL",
      "bio": "As a software engineering student I did multiple internships.",
      "description1": "Graduated with the highest honors from ESPRIT in 2021 after pursuing a degree in software engineering.",
      "description2": "Had my software engineering degree from ESPRIT in 2021.",
      "espritinfo": {
        "description": "Studied software engineering for 3 years."
      },
      "espritelectro": {
        "description": "Pursued studies in electromechanical engineering for 2 years before changing the course."
      },
      "isetrades": {
        "description": "Bachelor's degree in mechanical engineering specializing in energy."
      }
    },
    "activities": {
      "name": "ACTIVITIES",
      "bio": "Multiple things catch my attention.",
      "description": "Life doesn't stop when you stop coding.",
      "music": {
        "name": "Music",
        "description1": "Making and listening to music is a huge part of my life.",
        "description2": "Don't be surprised if clicking on this section one day will redirect you to Spotify."
      },
      "reading": {
        "name": "reading",
        "description": "I Love reading anything from history to novels.",
        "books": "Books"
      },
      "sports": {
        "description": "Anything that gets the blood pumping and involves challenges.",
        "jogging": "Jogging",
        "swimming": "Swimming"
      },
      "travel": {
        "name": "Travel",
        "description": "I love exploring new places and cultures."
      }
    },
    "resources": {
      "name": "RESOURCES I USE TO STAY UPDATED",
      "description": "Tech content creators, courses and channels I follow.",
      "items": {
        "hussein": "Hussein Nasser",
        "husseinDescription": "Deep dives into networking, databases, system design and backend. Clear explanations and real-world scenarios. Structured courses on Udemy too.",
        "webdevcody": "Web Dev Cody",
        "webdevcodyDescription": "Web development tutorials and project walkthroughs. React, Next.js and full-stack content.",
        "primeagen": "The Primeagen",
        "primeagenDescription": "Vim, TypeScript, system design and engineering practices. Straight-talking and highly technical.",
        "devto": "dev.to",
        "devtoDescription": "Developer community and blog. Articles, discussions and tutorials from developers worldwide.",
        "fireship": "Fireship",
        "fireshipDescription": "Short, high-energy tech explainers and tutorials. Frameworks, tools and concepts in minutes."
      }
    },
    "contanctme": "Contact Me",
    "copyright": "Copyright ",
    "takecare": "Take care and remember, health comes first."
  },
  "articles": {
    "searchs": {
      "searchbytitle": "Search by title",
      "entersearch": "Type your search",
      "noresultsfound": "No results found"
    }
  }
}
